kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/core_modules/rwip/src/rwip.c
/**
****************************************************************************************
*
* @file rwip.c
*
* @brief RW IP SW main module
*
* Copyright (C) RivieraWaves 2009-2013
*
*
****************************************************************************************
*/

/**
 ****************************************************************************************
 * @addtogroup RW IP SW main module
 * @ingroup ROOT
 * @brief The RW IP SW main module.
 *
 * @{
 ****************************************************************************************
 */

/*
 * INCLUDE FILES
 ****************************************************************************************
 */

#include "rwip_config.h"    // RW SW configuration

#include <string.h>         // for mem* functions
#include "co_version.h"
#include "rwip.h"           // RW definitions
#include "arch.h"           // Platform architecture definition
#include "arch_api.h"


#if (BLE_EMB_PRESENT)
    #include "rwble.h"          // rwble definitions
#endif //BLE_EMB_PRESENT

#if (BLE_HOST_PRESENT)
    #include "rwble_hl.h"       // BLE HL definitions
    #include "gapc.h"
    #include "smpc.h"
    #include "gattc.h"
    #include "attc.h"
    #include "atts.h"
    #include "l2cc.h"
#endif //BLE_HOST_PRESENT

#if (BLE_APP_PRESENT)
    #include "app.h"            // Application definitions
#endif //BLE_APP_PRESENT



#if USE_POWER_OPTIMIZATIONS
    #include "syscntl.h"
#endif
#include "lld_sleep.h"      // definitions for sleep mode
#include "llc.h"

#include "plf.h"            // platform definition
#include "rf.h"             // RF definitions

#if (GTL_ITF)
    #include "gtl.h"
    #include "gtl_eif.h"
#endif //GTL_ITF

#if (BLE_EMB_PRESENT)
    #include "hcic.h"           // HCI definition
    #include "hcic_eif.h"
#endif // BLE_EMB_PRESENT

#if (KE_SUPPORT)
    #include "ke.h"             // kernel definition
    #include "ke_event.h"       // kernel event
    #include "ke_timer.h"       // definitions for timer
    #include "ke_mem.h"         // kernel memory manager
    #include "ke_env.h"
#endif //KE_SUPPORT

#include "dbg.h"            // debug definition

#if ((BLE_APP_PRESENT) || ((BLE_HOST_PRESENT && (!GTL_ITF))))
    #include "app.h"
#endif //BLE_APP_PRESENT

#include "em_map_ble_user.h"
#include "em_map_ble.h"
#include "reg_ble_em_rx.h"
#include "arch_system.h"


uint32_t sleep_lp_cycles __attribute__((section("retention_mem_area0"), zero_init));
uint32_t slp_period_retained __attribute__((section("retention_mem_area0"), zero_init)); // sleep counter value at wakeup



/*
 * FORWARD DECLARATION OF GLOBAL FUNCTIONS
 ****************************************************************************************
 */
void ble_regs_push(void);
void smpc_regs_push(void);


/*
 * GLOBAL VARIABLES DECLARATION
 ****************************************************************************************
 */
extern boost_overhead_st set_boost_low_vbat1v_overhead;
extern uint32_t rcx_freq;
extern uint32_t lp_clk_sel;
extern bool sys_startup_flag;
extern uint8_t func_check_mem_flag;
extern uint32_t rcx_slot_duration_num;
extern uint32_t rcx_slot_duration_den;
extern uint8_t ke_mem_heaps_used;
extern struct arch_sleep_env_tag sleep_env;


/*
 * PROFILING CODE
 ****************************************************************************************
 */
#if (USE_POWER_OPTIMIZATIONS) && defined(POWER_OPT_PROFILING)

#define __RETAINED __attribute__((section("retention_mem_area0"), zero_init))

uint32_t dbg_evt_times[PROFILE_LOG_SZ];         // evt->time
uint32_t dbg_check_times[PROFILE_LOG_SZ];       // time left (in usec) after all sleep_duration checks have been completed
uint32_t dbg_sleep_times[PROFILE_LOG_SZ];       // sleep_duration
uint32_t dbg_remaining_times[PROFILE_LOG_SZ];   // time left just before sleep() is called (should be greater than 4 x LP cycles plus the time for the SLP ISR)
uint8_t  dbg_sleep_flag[PROFILE_LOG_SZ];        // 0xFF is sleep_duration is greater than the average sleep duration of the previous 10 sleeps
uint32_t dbg_slp_rem[PROFILE_LOG_SZ];

uint32_t dbg_slp_rem_min        __RETAINED;     // time remaining for SLP
uint32_t dbg_slp_rem_max        __RETAINED;
int32_t  dbg_slp_rem_diff_min   __RETAINED;     // time spent in SLP ISR until clock compensation has been requested
uint32_t dbg_evt_timer_wr_ptr   __RETAINED;     // write index to the dbg_ arrays
uint32_t dbg_sleep_dur_last     __RETAINED;     // last calculated sleep_duration
uint32_t dbg_sleep_dur_avg      __RETAINED;     // average sleep_duration of the previous 10 sleeps
uint32_t dbg_sleep_dur_sum      __RETAINED;     // sum of the sleep_duration of the previous 10 sleeps (used for averaging)
uint32_t dbg_sleep_dur_meas     __RETAINED;     // counter to know when we have 10 samples available for averaging
uint32_t dbg_remaining_time_min __RETAINED;     // minimum time remaining for sleep() and the SLP ISR 


void pow_profile_exec1(uint32_t sleep_duration)
{
    struct lld_evt_tag *evt = (struct lld_evt_tag *)co_list_pick(&lld_evt_env.evt_prog);

    dbg_sleep_times[dbg_evt_timer_wr_ptr] = sleep_duration;
        
    dbg_sleep_dur_last = sleep_duration;
    if (dbg_sleep_dur_meas < 10)
    {
        dbg_sleep_dur_meas++;
        dbg_sleep_dur_sum += sleep_duration;
    }
    else
    {
        dbg_sleep_dur_avg = dbg_sleep_dur_sum / 10;
        dbg_sleep_dur_sum = 0;
        dbg_sleep_dur_meas = 0;
    }
    
    do
    {
        if (evt == NULL)
            break;

        if (evt->prog)
            break;
        
        dbg_evt_times[dbg_evt_timer_wr_ptr] = evt->time;
        if (sleep_duration > dbg_sleep_dur_avg)
            dbg_sleep_flag[dbg_evt_timer_wr_ptr] = 0xFF;
        else
            dbg_sleep_flag[dbg_evt_timer_wr_ptr] = 0;
    } while (0);        
}


void pow_profile_exec2(void)
{
    dbg_remaining_times[dbg_evt_timer_wr_ptr] = ble_finetimecnt_get();
    if (dbg_remaining_time_min > dbg_remaining_times[dbg_evt_timer_wr_ptr])
        dbg_remaining_time_min = dbg_remaining_times[dbg_evt_timer_wr_ptr];
    
    dbg_evt_timer_wr_ptr++;
    if (dbg_evt_timer_wr_ptr == PROFILE_LOG_SZ) 
        dbg_evt_timer_wr_ptr = 0;
}


// Initialize dbg_remaining_time_min
    #define POWER_PROFILE_INIT                                          \
    {                                                                   \
        if (sys_startup_flag)                                           \
        {                                                               \
            dbg_remaining_time_min = 0xFFFFFFFF;                        \
            dbg_slp_rem_min = 0xFFFFFFFF;                               \
            dbg_slp_rem_diff_min = 1000000;                             \
        }                                                               \
    }


