kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/core_modules/rwip/src/rwip.c
// Update dbg_check_times
    #define POWER_PROFILE_CHECKS_COMPLETED                              \
    {                                                                   \
        dbg_check_times[dbg_evt_timer_wr_ptr] = ble_finetimecnt_get();  \
    }


    #define POWER_PROFILE_SLEEP_TIMES                                   \
    {                                                                   \
        pow_profile_exec1(sleep_duration);                              \
    }


    #define POWER_PROFILE_REMAINING_TIME                                \
    {                                                                   \
        pow_profile_exec2();                                            \
    }


#else
    
    #define POWER_PROFILE_INIT {}
    #define POWER_PROFILE_CHECKS_COMPLETED {}
    #define POWER_PROFILE_SLEEP_TIMES {}
    #define POWER_PROFILE_REMAINING_TIME {}
    
#endif // (USE_POWER_OPTIMIZATIONS) && (POWER_OPT_PROFILING)


/*
 * LOCAL FUNCTIONS DEFINITIONS
 ****************************************************************************************
 */
static uint32_t rwip_slot_2_lpcycles(uint32_t slot_cnt)
{
    uint32_t lpcycles;

    // Sanity check: The number of slots should not be too high to avoid overflow
    ASSERT_ERR(slot_cnt < 1000000);

    // Compute the low power clock cycles - case of a 32.768kHz clock
    lpcycles = (slot_cnt << 11)/100;
    
    if(lpcycles)
    {
       lpcycles--;
    }

    
    return(lpcycles);
}


static uint32_t rwip_slot_2_lpcycles_rcx(uint32_t slot_cnt)
{
    volatile uint32_t lpcycles;

    // Sanity check: The number of slots should not be too high to avoid overflow
    ASSERT_ERR(slot_cnt < 1000000);

    lpcycles = (uint32_t)((uint64_t)slot_cnt * rcx_slot_duration_num) / rcx_slot_duration_den;
    
    return(lpcycles);
}



sleep_mode_t rwip_sleep(void)
{
    sleep_mode_t proc_sleep = mode_active;
    uint32_t twirq_set_value;
    uint32_t twirq_reset_value;
    uint32_t twext_value;

    uint32_t sleep_duration = jump_table_struct[max_sleep_duration_external_wakeup_pos];//MAX_SLEEP_DURATION_EXTERNAL_WAKEUP;
    
    // We may lower the clock now while we are waiting the BLE to go to sleep...
    bool slow_system_clk = false;

    uint32_t xtal16m_settling_cycles;
    uint32_t tmp_dur;
    
#if (!DEVELOPMENT_DEBUG)
    uint32_t sleep_lp_cycles;
#endif

    DBG_SWDIAG(SLEEP, ALGO, 0);

    if (BLE_APP_PRESENT)
    {
        if ( arch_ble_ext_wakeup_get() || (rwip_env.ext_wakeup_enable == 2) )  // sleep forever!
            sleep_duration = 0;
    }
    else if (!EXTERNAL_WAKEUP) // sleep_duration will remain as it was set above....
    {
        if (rwip_env.ext_wakeup_enable == 2)
            sleep_duration = 0;
    }
        
    do
    {
        /************************************************************************
         **************            CHECK STARTUP FLAG             **************
         ************************************************************************/
        POWER_PROFILE_INIT;

        // Do not allow sleep if system is in startup period
        if (check_sys_startup_period())
            break;
        
        /************************************************************************
         **************            CHECK KERNEL EVENTS             **************
         ************************************************************************/
        // Check if some kernel processing is ongoing
        if (!ke_sleep_check())
            break;
        
        // Processor sleep can be enabled
        proc_sleep = mode_idle;

        DBG_SWDIAG(SLEEP, ALGO, 1);

        

        /************************************************************************
         **************             CHECK ENABLE FLAG              **************
         ************************************************************************/
        // Check sleep enable flag
        if(!rwip_env.sleep_enable)
            break;

        
        /************************************************************************
         **************           CHECK RADIO POWER DOWN           **************
         ************************************************************************/
        // Check if BLE + Radio are still sleeping
        if(GetBits16(SYS_STAT_REG, RAD_IS_DOWN)) {
            // If BLE + Radio are in sleep return the appropriate mode for ARM
            proc_sleep = mode_sleeping;
            break;
        }

        /************************************************************************
         **************              CHECK RW FLAGS                **************
         ************************************************************************/
        // First check if no pending procedure prevents us from going to sleep
        if (rwip_prevent_sleep_get() != 0)
            break;

        DBG_SWDIAG(SLEEP, ALGO, 2);

        
        /************************************************************************
         **************           CHECK EXT WAKEUP FLAG            **************
         ************************************************************************/
        /* If external wakeup is enabled, sleep duration can be set to maximum, otherwise
         * the system must be woken-up periodically to poll incoming packets from HCI */
        if((BLE_APP_PRESENT == 0) || (BLE_INTEGRATED_HOST_GTL == 1 )) // No need for periodic wakeup if we have full-hosted system
        {
            if(!rwip_env.ext_wakeup_enable)
                sleep_duration = jump_table_struct[max_sleep_duration_periodic_wakeup_pos]; // MAX_SLEEP_DURATION_PERIODIC_WAKEUP;
        }

        /************************************************************************
         *                                                                      *
         *                   CHECK DURATION UNTIL NEXT EVENT                    *
         *                                                                      *
         ************************************************************************/
        // If there's any timer pending, compute the time to wake-up to serve it
        if (ke_env.queue_timer.first != NULL)
            sleep_duration = jump_table_struct[max_sleep_duration_external_wakeup_pos];
            if (USE_POWER_OPTIMIZATIONS)
            {
                // Store sleep_duration calculated so far. Check below if sleep would be allowed.
                // If not, there's no reason to verify / ensure the available time for SLP...
                tmp_dur = sleep_duration;
            }
    

        /************************************************************************
         **************            CHECK KERNEL TIMERS             **************
         ************************************************************************/
        // Compute the duration up to the next software timer expires
        if (!ke_timer_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
            break;
         
        // Check if a kernel timer has expired before the above ke_timer_sleep_check() 
        // function call. If that happens the ke_timer_sleep_check() will incorrectly 
        // allow the system to enter sleep, because the timeout of the first timer is 
        // already in the past, and consequently the timer event will not be serviced 
        // until the next system wake up (the rwip_sleep() function is being called 
        // while the interrupts are disabled).
        if (ble_intrawstat_get() & BLE_GROSSTGTIMINTRAWSTAT_BIT)
            break;

        DBG_SWDIAG(SLEEP, ALGO, 3);

