kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/core_modules/rwip/src/rwip.c
        if (BLE_EMB_PRESENT)
        {
            /************************************************************************
             **************                 CHECK BLE                  **************
             ************************************************************************/
            // Compute the duration up to the next BLE event
            if (!lld_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
                break;
        }
        
        DBG_SWDIAG(SLEEP, ALGO, 4);

        if (HCIC_ITF)
        /************************************************************************
         **************                 CHECK HCI                  **************
         ************************************************************************/
        {
            if((BLE_APP_PRESENT == 0) || (BLE_INTEGRATED_HOST_GTL == 1 ))
            {       
                // Try to switch off HCI
                if (!hci_enter_sleep())
                    break;
            }
        }
        
        if (GTL_ITF)
        /************************************************************************
         **************                 CHECK TL                   **************
         ************************************************************************/
        {
            if((BLE_APP_PRESENT == 0) || (BLE_INTEGRATED_HOST_GTL == 1 ))
            {
                // Try to switch off Transport Layer
                if (!gtl_enter_sleep())
                    break;
            }
        }

        DBG_SWDIAG(SLEEP, ALGO, 6);
        
        if (USE_POWER_OPTIMIZATIONS)
        {
            /************************************************************************
             ******      BLOCK UNTIL THERE'S TIME FOR sleep() AND SLP ISR      ******
             ************************************************************************/
            
            bool rcx_duration_corr = false;
            
            // Restore sleep_duration
            sleep_duration = tmp_dur;
            /*
             * Wait until there's enough time for SLP to restore clocks when the chip wakes up.
             * Then check again if sleep is possible.
             */
            if ( arch_clk_is_RCX20() )
            {
                xtal16m_settling_cycles = lld_sleep_us_2_lpcycles_sel_func(XTAL16M_SETTLING_IN_USEC);
                
                while ( (ble_finetimecnt_get() < 550) && (ble_finetimecnt_get() > 200) ); 
                // If we are close to the end of this slot then the actual sleep entry will
                // occur during the next one. But the sleep_duration will have been calculated
                // based on the current slot...
                if (ble_finetimecnt_get() <= 200)
                    rcx_duration_corr = true;
            }
            else if ( arch_clk_is_XTAL32( ) )
            {
                while (ble_finetimecnt_get() < 300);  
            }
            
            /************************************************************************
             *                                                                      *
             *                   CHECK DURATION UNTIL NEXT EVENT                    *
             *                       (this is the 2nd check)                        *
             *                                                                      *
             ************************************************************************/
            bool sleep_check = false;
            
            do
            {
                /************************************************************************
                 **************            CHECK KERNEL TIMERS (2)         **************
                 ************************************************************************/
                // Compute the duration up to the next software timer expires
                if (!ke_timer_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
                    break;
                
                // Check if a kernel timer has expired before the above ke_timer_sleep_check() 
                // function call. If that happens the ke_timer_sleep_check() will incorrectly 
                // allow the system to enter sleep, because the timeout of the first timer is 
                // already in the past, and consequently the timer event will not be serviced 
                // until the next system wake up (the rwip_sleep() function is being called 
                // while the interrupts are disabled).
                if (ble_intrawstat_get() & BLE_GROSSTGTIMINTRAWSTAT_BIT)
                    break;

                DBG_SWDIAG(SLEEP, ALGO, 3);

                if (BLE_EMB_PRESENT)
                {
                    /************************************************************************
                     **************                 CHECK BLE (2)              **************
                     ************************************************************************/
                    // Compute the duration up to the next BLE event
                    if (!lld_sleep_check(&sleep_duration, rwip_env.wakeup_delay))
                        break;
                }
                
                sleep_check = true;
                
            } while(0);
            
            if (!sleep_check)
            {
                if((BLE_APP_PRESENT == 0) || (BLE_INTEGRATED_HOST_GTL == 1 ))
                {
                    if (BLE_HOST_PRESENT)		
                            gtl_eif_init();
                    else
                            hci_eif_init();
                    
                }
                // sleep is aborted and serial i/f communication is restored
                break;
            }
            
            if (sleep_duration && rcx_duration_corr)
                sleep_duration--;
            
            DBG_SWDIAG(SLEEP, ALGO, 4);
        }

        POWER_PROFILE_CHECKS_COMPLETED;
        
        /************************************************************************
         **************          PROGRAM CORE DEEP SLEEP           **************
         ************************************************************************/
        if ( arch_clk_is_RCX20() )
        {
            if (!USE_POWER_OPTIMIZATIONS)
            {
               twirq_set_value = lld_sleep_us_2_lpcycles_sel_func(XTAL_TRIMMING_TIME_USEC);
                
