kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/core_modules/rwip/src/rwip.c
                twirq_reset_value = TWIRQ_RESET_VALUE;
                
                // TWEXT setting
                twext_value = TWEXT_VALUE_RCX;
            }
            else
            {
                // Calculate the time we need to wake-up before "time 0" to do XTAL16 settling,
                // call periph_init() and power-up the BLE core.
                uint32_t lpcycles = lld_sleep_us_2_lpcycles_sel_func(LP_ISR_TIME_USEC);
                
                // Set TWIRQ_SET taking into account that some LP cycles are needed for the power up FSM.
                twirq_set_value = RCX_POWER_UP_TIME + lpcycles;
                if (sleep_env.slp_state == ARCH_DEEP_SLEEP_ON)
                    twirq_set_value += RCX_OTP_COPY_OVERHEAD;
                
                // BOOST mode + RCX is not supported
                if (GetBits16(ANA_STATUS_REG, BOOST_SELECTED) == 1)
                    ASSERT_WARNING(0);

                // Program LP deassertion to occur when the XTAL16M has settled
                twirq_reset_value = lpcycles - xtal16m_settling_cycles;
                
                // TWEXT setting
                twext_value = lpcycles;
             }
        }
        else if ( arch_clk_is_XTAL32( ) )
        {
            if (!USE_POWER_OPTIMIZATIONS)
            {
                twirq_set_value = XTAL_TRIMMING_TIME;
                twirq_reset_value = TWIRQ_RESET_VALUE;
                twext_value = TWEXT_VALUE_XTAL32;
            }
            else       
            {
                // The time we need to wake-up before "time 0" to do XTAL16 settling,
                // call periph_init() and power-up the BLE core is LP_ISR_TIME_XTAL32_CYCLES in this case.
                
                // Set TWIRQ_SET taking into account that some LP cycles are needed for the power up FSM.
                twirq_set_value = XTAL32_POWER_UP_TIME + LP_ISR_TIME_XTAL32_CYCLES;
                if (sleep_env.slp_state == ARCH_DEEP_SLEEP_ON)
                    twirq_set_value += XTAL32_OTP_COPY_OVERHEAD;
                
                // Adjust TWIRQ_SET in case of BOOST mode, if needed
                if (set_boost_low_vbat1v_overhead == APPLY_OVERHEAD)
                    twirq_set_value += BOOST_POWER_UP_OVERHEAD;
                set_boost_low_vbat1v_overhead = NOT_MEASURED;

                // Program LP deassertion to occur when the XTAL16M has settled
                twirq_reset_value = LP_ISR_TIME_XTAL32_CYCLES - XTAL16M_SETTLING_IN_XTAL32_CYCLES;
                
                // TWEXT setting
                twext_value = LP_ISR_TIME_XTAL32_CYCLES;
            }
        }

       
        //Prepare BLE_ENBPRESET_REG for next sleep cycle
        SetBits32(BLE_ENBPRESET_REG, TWIRQ_RESET, twirq_reset_value);   // TWIRQ_RESET
        SetBits32(BLE_ENBPRESET_REG, TWIRQ_SET, twirq_set_value);       // TWIRQ_SET
        SetBits32(BLE_ENBPRESET_REG, TWEXT, twext_value);               // TWEXT

        //Everything ready for sleep!
        proc_sleep = mode_sleeping;
        
        if (USE_POWER_OPTIMIZATIONS)
        {
            // Eliminate any additional delays.
            if (sleep_duration) 
                sleep_duration += SLEEP_DURATION_CORR;
            
            POWER_PROFILE_SLEEP_TIMES;
        }

        if (BLE_EMB_PRESENT)
        {
            // Put BT core into deep sleep
            if ( arch_clk_is_XTAL32( ) )
                sleep_lp_cycles = rwip_slot_2_lpcycles(sleep_duration);
            else if ( arch_clk_is_RCX20() )
                sleep_lp_cycles = rwip_slot_2_lpcycles_rcx(sleep_duration);
            
            lld_sleep_enter(sleep_lp_cycles, rwip_env.ext_wakeup_enable);
        }
     
        DBG_SWDIAG(SLEEP, SLEEP, 1);

        /************************************************************************
         **************               SWITCH OFF RF                **************
         ************************************************************************/        
        POWER_PROFILE_REMAINING_TIME;
        
        rwip_rf.sleep();
        
        if (USE_POWER_OPTIMIZATIONS)
        {
            
            if (BLE_APP_PRESENT)            
            {
                if ( app_use_lower_clocks_check() )
                {
                    // It will save some power if you lower the clock while waiting for STAT...
                    SetBits16(CLK_AMBA_REG, PCLK_DIV, 3);  // lowest is 2MHz (div 8, source is @16MHz)
                    SetBits16(CLK_AMBA_REG, HCLK_DIV, 3);
                    
                    slow_system_clk = true;
                }
            }
        }
                
        while(!ble_deep_sleep_stat_getf());
                
        //check and wait till you may disable the radio. 32.768KHz XTAL must be running!
        //(debug note: use BLE_CNTL2_REG:MON_LP_CLK bit to check (write 0, should be set to 1 by the BLE))
        while ( !(GetWord32(BLE_CNTL2_REG) & RADIO_PWRDN_ALLOW) ) {};
        
        if (USE_POWER_OPTIMIZATIONS)
        {
            if (slow_system_clk)
            {
                // and restore clock rates (refer to a couple of lines above)
                syscntl_use_highest_amba_clocks();
            }
        }

        ble_regs_push();    // push the ble ret.vars to retention memory
//        smpc_regs_push();   // push smpc ble ret.vars to retention memory
        
        //BLE CLK must be turned off when DEEP_SLEEP_STAT is set
        SetBits16(CLK_RADIO_REG, BLE_ENABLE, 0);   												

    } while(0);

    return proc_sleep;
}


#if (!BLE_HOST_PRESENT)
void rwip_init(uint32_t error)
{
    uint8_t length = 1;
    uint8_t sleep_enable;
    uint8_t ext_wakeup_enable;

    // Reset RW environment
    memset(&rwip_env, 0, sizeof(rwip_env));
	
	ke_mem_heaps_used = KE_MEM_BLOCK_MAX;

    #if (KE_SUPPORT)
    // Initialize kernel
    ke_init();
    // Initialize memory heap used by kernel.
    #if (KE_MEM_RW)
    // Memory allocated for environment variables
    ke_mem_init(KE_MEM_ENV,(uint8_t*)(jump_table_struct[rwip_heap_env_pos]),     jump_table_struct[rwip_heap_env_size]);	
    // Memory allocated for Attribute database
    ke_mem_init(KE_MEM_ATT_DB,(uint8_t*)(jump_table_struct[rwip_heap_db_pos]),      jump_table_struct[rwip_heap_db_size]);	        
    // Memory allocated for kernel messages
    ke_mem_init(KE_MEM_KE_MSG,(uint8_t*)(jump_table_struct[rwip_heap_msg_pos]),     jump_table_struct[rwip_heap_msg_size]);
    // Non Retention memory block
    ke_mem_init(KE_MEM_NON_RETENTION, (uint8_t*)(jump_table_struct[rwip_heap_non_ret_pos]), jump_table_struct[rwip_heap_non_ret_size]);

    #endif // (KE_MEM_RW)
    #endif //KE_SUPPORT

    #if (GTL_ITF)
    // Initialize the Generic Transport Layer
    gtl_init(rwip_eif_get(RWIP_EIF_AHI));
    #endif //GTL_ITF

    // Initialize RF
    rf_init(&rwip_rf);
    SetBits32(BLE_RADIOCNTL1_REG, XRFSEL, 3);

    #if (BLE_EMB_PRESENT)
    // Initialize BLE
    rwble_init();
    #endif //BLE_EMB_PRESENT

