kercre123/victor/robot/fixture/cube/sdk_da1458x/5.0.4/sdk/platform/core_modules/rwip/src/rwip.c
    #if (BLE_HOST_PRESENT)
    // Initialize BLE Host stack
    rwble_hl_init();
    #endif //BLE_HOST_PRESENT

    // Activate deep sleep feature if enabled in NVDS
    if(nvds_get(NVDS_TAG_SLEEP_ENABLE, &length, &sleep_enable) == NVDS_OK)
    {
        if(sleep_enable != 0)
        {
            rwip_env.sleep_enable = true;

            // Set max sleep duration depending on wake-up mode
            if(nvds_get(NVDS_TAG_EXT_WAKEUP_ENABLE, &length, &ext_wakeup_enable) == NVDS_OK)
            {
                if(ext_wakeup_enable != 0)
                {
                    rwip_env.ext_wakeup_enable = ext_wakeup_enable;
                }
            }
        }
    }

    // If FW initializes due to FW reset, send the message to Host
    if(error != RESET_NO_ERROR)
    {

#if (BLE_EMB_PRESENT && HCIC_ITF)
        rwble_send_message(error);
#elif (BLE_HOST_PRESENT && GTL_ITF)
        rwble_hl_send_message(error);
#endif // BLE_EMB_PRESENT
    }

    /*
     ************************************************************************************
     * Application initialization
     ************************************************************************************
     */
    // moved to main
    //    if(jump_table_struct[0]==TASK_APP)
    // Initialize APP
    //    app_init();

    func_check_mem_flag = 0;//false;
}


void rwip_wakeup(void)
{
    DBG_SWDIAG(SLEEP, SLEEP, 0);

    // Prevent going to deep sleep until a slot interrupt is received
    rwip_prevent_sleep_set(RW_WAKE_UP_ONGOING);

    #if (BLE_EMB_PRESENT)
    // Wake-up BLE core
    lld_sleep_wakeup();
    #endif //BLE_EMB_PRESENT

    #if (HCIC_ITF)
    // Restart the flow on the HCI
    hci_exit_sleep();
    #endif //HCIC_ITF

    #if (GTL_ITF)
    // Restart the flow on the GTL
    gtl_exit_sleep();
    #endif //GTL
}
#endif // (!BLE_HOST_PRESENT)
